In [1]:
# Day3: Pandas Basics

In [2]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [24, 27, 22],
    "Role": ["Analyst", "Engineer", "Manager"]
}

df = pd.DataFrame(data)
print(df)

      Name  Age      Role
0    Alice   24   Analyst
1      Bob   27  Engineer
2  Charlie   22   Manager

In [5]:
df.head() # First Rows

      Name  Age      Role
0    Alice   24   Analyst
1      Bob   27  Engineer
2  Charlie   22   Manager

In [6]:
df.info()  # column info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Role    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [9]:
df["Name"] # Select one column

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [11]:
df.loc[2] # Access by label

Name    Charlie
Age          22
Role    Manager
Name: 2, dtype: object

In [12]:
df.iloc[2]

Name    Charlie
Age          22
Role    Manager
Name: 2, dtype: object

In [13]:
# Create a dataframe with 3 colums:"Student","maths","Science"
# Add atleast four rows of data.

In [14]:
data={
    "Student": ["Greek","Polo","Zeus","Assassian"],
    "Maths" : ["90","80","70","60"],
    "Science":["60","70","80","90"]
}

In [16]:
print(data)

{'Student': ['Greek', 'Polo', 'Zeus', 'Assassian'], 'Maths': ['90', '80', '70', '60'], 'Science': ['60', '70', '80', '90']}

In [18]:
df= pd.DataFrame(data)
print(df)

     Student Maths Science
0      Greek    90      60
1       Polo    80      70
2       Zeus    70      80
3  Assassian    60      90

In [24]:
df["Maths"]

0    90
1    80
2    70
3    60
Name: Maths, dtype: object

In [25]:
df.loc[2]

Student    Zeus
Maths        70
Science      80
Name: 2, dtype: object

In [26]:
df.iloc[2]

Student    Zeus
Maths        70
Science      80
Name: 2, dtype: object

In [30]:
print(df["Science"].dtype)
print(df["Science"].head())
df["Science"] = pd.to_numeric(df["Science"], errors="coerce")

object
0    60
1    70
2    80
3    90
Name: Science, dtype: object

In [31]:
avg = np.average(df["Science"])
print(avg)

75.0

In [32]:
## When you work with real ML data, columns often look numeric but are actually text
print(df["Science"].head())

0    60
1    70
2    80
3    90
Name: Science, dtype: int64

In [33]:
print(df["Science"].dtype)

int64

In [34]:
print(df["Science"].unique())

[60 70 80 90]

In [35]:
def safe_average(series):
    try:
        numeric_series = pd.to_numeric(series, errors="coerce")
        if numeric_series.isna().any():
            print("⚠️ Warning: Some values could not be converted and became NaN")
        return np.average(numeric_series.dropna())
    except Exception as e:
        print("Error while computing average:", e)
        return None

avg = safe_average(df["Science"])
print("Average =", avg)

Average = 75.0

In [36]:
import pandas as pd

# Suppose your DataFrame looks like this:
df = pd.DataFrame({
    "Science": ["60", "70", "absent", "90"]
})

# Replace "absent" with 0 and convert everything to numeric
df["Science"] = df["Science"].replace("absent", 0).astype(int)

print(df)

   Science
0       60
1       70
2        0
3       90

In [37]:
print("Average:", df["Science"].mean())

Average: 55.0

In [38]:
import pandas as pd

df = pd.DataFrame({
    "Science": [60, 70, 0, 90]
})
print(df)

   Science
0       60
1       70
2        0
3       90

Task 1: Rename the column

Rename "Science" → "Science Marks"

In [41]:
df.columns=["Science Marks"]

In [42]:
df

   Science Marks
0             60
1             70
2              0
3             90

In [43]:
df["Maths"]=[50, 65, 80, 75]

In [44]:
df

   Science Marks  Maths
0             60     50
1             70     65
2              0     80
3             90     75

In [45]:
filterdf=df[df['Maths']>70]

In [46]:
filterdf

   Science Marks  Maths
2              0     80
3             90     75

In [47]:
df

   Science Marks  Maths
0             60     50
1             70     65
2              0     80
3             90     75

In [48]:
dftemp=df

In [49]:
dftemp

   Science Marks  Maths
0             60     50
1             70     65
2              0     80
3             90     75

In [52]:
dftemp["Science Marks"]= df["Science Marks"].replace(0,np.nan)

In [53]:
dftemp

   Science Marks  Maths
0           60.0     50
1           70.0     65
2            NaN     80
3           90.0     75

In [54]:
df

   Science Marks  Maths
0           60.0     50
1           70.0     65
2            NaN     80
3           90.0     75

In [58]:
average_ScienceMarks = df["Science Marks"].mean()

In [59]:
print (average_ScienceMarks)

73.33333333333333

In [60]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "Science Marks": [60, 70, np.nan, 90, 50, np.nan],
    "Maths": [50, 65, 80, 75, 85, 40]
})

In [61]:
df

   Science Marks  Maths
0           60.0     50
1           70.0     65
2            NaN     80
3           90.0     75
4           50.0     85
5            NaN     40

In [62]:
asm=df["Science Marks"].mean()

In [63]:
asm

np.float64(67.5)

In [64]:
df["Science Marks"]=df["Science Marks"].replace(np.nan,asm)

In [65]:
df

   Science Marks  Maths
0           60.0     50
1           70.0     65
2           67.5     80
3           90.0     75
4           50.0     85
5           67.5     40

In [66]:
high_scorers=df.copy()

In [71]:
high_scorers=high_scorers[(high_scorers["Science Marks"]>65) & (high_scorers["Maths"]>70) ]

In [72]:
high_scorers

   Science Marks  Maths
2           67.5     80
3           90.0     75

In [73]:
df["Average"]=(df["Science Marks"] + df["Maths"])/2

In [74]:
df

   Science Marks  Maths  Average
0           60.0     50    55.00
1           70.0     65    67.50
2           67.5     80    73.75
3           90.0     75    82.50
4           50.0     85    67.50
5           67.5     40    53.75

In [78]:
def assign_grade(avg):
    if avg>85:
        return "A"
    elif avg>70:
        return "B"
    elif avg>50:
        return "C"
    else:
        return "D"

In [81]:
df["Grade"]=df["Average"].apply(assign_grade)

In [82]:
df

   Science Marks  Maths  Average Grade
0           60.0     50    55.00     C
1           70.0     65    67.50     C
2           67.5     80    73.75     B
3           90.0     75    82.50     B
4           50.0     85    67.50     C
5           67.5     40    53.75     C

In [83]:
top_students= df[df["Grade"].isin(["A","B"])]

In [84]:
top_students

   Science Marks  Maths  Average Grade
2           67.5     80    73.75     B
3           90.0     75    82.50     B

In [85]:
# Group by Grade
grade_stats = df.groupby("Grade").agg({
    "Science Marks": "mean",   # average science marks
    "Maths": "mean",           # average maths marks
    "Grade": "count"           # count of students
})

# Rename the 'Grade' count column
grade_stats = grade_stats.rename(columns={"Grade": "Student Count"})

print(grade_stats)

       Science Marks  Maths  Student Count
Grade
B             78.750   77.5              2
C             61.875   60.0              4

In [100]:
grade_stats=grade_stats.sort_values(by='Science Marks',ascending=False).reset_index()

In [101]:
grade_stats

  Grade  Science Marks  Maths  Student Count
0     B         78.750   77.5              2
1     C         61.875   60.0              4

df

In [107]:
df["Passed"]=np.where((df["Science Marks"]>=40) & (df["Maths"]>=40),"Pass","Fail")

In [108]:
df

   Science Marks  Maths  Average Grade Passed
0           60.0     50    55.00     C   Pass
1           70.0     65    67.50     C   Pass
2           67.5     80    73.75     B   Pass
3           90.0     75    82.50     B   Pass
4           50.0     85    67.50     C   Pass
5           67.5     40    53.75     C   Pass

In [109]:
# Add a new row (student with Science=35, Maths=60)
df.loc[len(df)] = [35, 60, None, None, None]   # placeholders for Average, Grade, Passed

# Recalculate Average, Grade, and Passed for this row
df["Average"] = (df["Science Marks"] + df["Maths"]) / 2
df["Grade"] = np.where(df["Average"] >= 80, "A",
              np.where(df["Average"] >= 60, "B", "C"))
df["Passed"] = np.where((df["Science Marks"] >= 40) & (df["Maths"] >= 40), "Pass", "Fail")

print(df)

   Science Marks  Maths  Average Grade Passed
0           60.0   50.0    55.00     C   Pass
1           70.0   65.0    67.50     B   Pass
2           67.5   80.0    73.75     B   Pass
3           90.0   75.0    82.50     A   Pass
4           50.0   85.0    67.50     B   Pass
5           67.5   40.0    53.75     C   Pass
6           35.0   60.0    47.50     C   Fail

Larger dataset (more rows + variety).

GroupBy operations (like pivot tables in Excel).

Aggregation (mean, sum, count).

Sorting & filtering after grouping.

In [110]:
import pandas as pd

data = {
    "Student": ["Amit", "Neha", "Raj", "Simran", "Arjun", "Priya", "Kiran", "Meena"],
    "Section": ["A", "A", "B", "B", "A", "B", "A", "B"],
    "Maths": [80, 65, 70, 85, 60, 55, 90, 75],
    "Science": [78, 55, 68, 82, 49, 60, 88, 72],
    "English": [85, 70, 75, 90, 65, 58, 92, 80]
}

df = pd.DataFrame(data)
print(df)

  Student Section  Maths  Science  English
0    Amit       A     80       78       85
1    Neha       A     65       55       70
2     Raj       B     70       68       75
3  Simran       B     85       82       90
4   Arjun       A     60       49       65
5   Priya       B     55       60       58
6   Kiran       A     90       88       92
7   Meena       B     75       72       80

In [150]:
secdf=df.copy()

In [151]:
secdf

  Student Section  Maths  Science  English
0    Amit       A     80       78       85
1    Neha       A     65       55       70
2     Raj       B     70       68       75
3  Simran       B     85       82       90
4   Arjun       A     60       49       65
5   Priya       B     55       60       58
6   Kiran       A     90       88       92
7   Meena       B     75       72       80

In [152]:
secdf= secdf.groupby("Section").agg(
    Student_count=("Student","count"),
    Maths_Avg=("Maths","mean"),
    Science_Avg=("Science","mean"),
    English_Mean=("English","mean")
)

In [153]:
secdf.reset_index()

  Section  Student_count  Maths_Avg  Science_Avg  English_Mean
0       A              4      73.75         67.5         78.00
1       B              4      71.25         70.5         75.75

In [164]:
secdf["Overall_Avg"]=(secdf["Maths_Avg"]+secdf["Science_Avg"]+secdf["English_Mean"])/3

In [165]:
secdf["Overall_Avg"].idxmax()

'A'

In [166]:
top_section = secdf["Overall_Avg"].idxmin()   # Section with highest avg
top_avg = secdf["Overall_Avg"].max()         # The highest avg value

print("Top Section:", top_section)
print("Overall Average:", top_avg)

Top Section: B
Overall Average: 73.08333333333333

In [167]:
bottom_section_row = secdf.loc[secdf["Overall_Avg"].idxmin()]
print(bottom_section_row)

Student_count     4.00
Maths_Avg        71.25
Science_Avg      70.50
English_Mean     75.75
Overall_Avg      72.50
Name: B, dtype: float64

In [168]:
top_section_row = secdf.loc[secdf["Overall_Avg"].idxmax()]
bottom_section_row = secdf.loc[secdf["Overall_Avg"].idxmin()]

In [174]:
summarydf = pd.DataFrame([top_section_row, bottom_section_row],
                         index=["Top Section", "Bottom Section"])

In [175]:
summarydf

,Student_count,Maths_Avg,Science_Avg,English_Mean,Overall_Avg
Top Section,4.0,73.75,67.5,78.00,73.083333
Bottom Section,4.0,71.25,70.5,75.75,72.500000

In [177]:
summarydf = pd.DataFrame(
    [top_section_row[["Student_count", "Overall_Avg"]],
     bottom_section_row[["Student_count", "Overall_Avg"]]],
    index=["Top Section", "Bottom Section"]
)

In [178]:
summarydf

                Student_count  Overall_Avg
Top Section               4.0    73.083333
Bottom Section            4.0    72.500000

In [179]:
summarydf = pd.DataFrame({
    "Section": [top_section_row.name, bottom_section_row.name],
    "Student": [top_section_row["Student_count"], bottom_section_row["Student_count"]],
    "Overall_Avg": [top_section_row["Overall_Avg"], bottom_section_row["Overall_Avg"]]
}, index=["Top Section", "Bottom Section"])

In [180]:
summarydf

               Section  Student  Overall_Avg
Top Section          A      4.0    73.083333
Bottom Section       B      4.0    72.500000

In [181]:
def highlight_rows(row):
    if row.name == "Top Section":
        return ['background-color: lightgreen'] * len(row)
    elif row.name == "Bottom Section":
        return ['background-color: lightcoral'] * len(row)
    else:
        return [''] * len(row)

styled_summary = summarydf.style.apply(highlight_rows, axis=1)
styled_summary